In [2]:
import pandas as pd

In [3]:
pd.set_option('display.max_columns', None)

# Data Exploration

## Parquet files
These parquet files too large for my PC to handle.<br>
So we are going to explore the data using `immigration_data_sample.csv`.

In [35]:
df_p = pd.read_parquet('/home/felipe/Documentos/Udacity/Data Engineering Nanodegree/Udacity_final_project/data/parquet_files/', engine='pyarrow')
df_p.head()

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,6.0,2016.0,4.0,692.0,692.0,XXX,20573.0,NaN,None,NaN,37.0,2.0,1.0,None,None,None,T,None,U,None,1979.0,10282016,None,None,None,1.897628e+09,None,B2
1,7.0,2016.0,4.0,254.0,276.0,ATL,20551.0,1.0,AL,NaN,25.0,3.0,1.0,20130811,SEO,None,G,None,Y,None,1991.0,D/S,M,None,None,3.736796e+09,00296,F1
2,15.0,2016.0,4.0,101.0,101.0,WAS,20545.0,1.0,MI,20691.0,55.0,2.0,1.0,20160401,None,None,T,O,None,M,1961.0,09302016,M,None,OS,6.666432e+08,93,B2
3,16.0,2016.0,4.0,101.0,101.0,NYC,20545.0,1.0,MA,20567.0,28.0,2.0,1.0,20160401,None,None,O,O,None,M,1988.0,09302016,None,None,AA,9.246846e+10,00199,B2
4,17.0,2016.0,4.0,101.0,101.0,NYC,20545.0,1.0,MA,20567.0,4.0,2.0,1.0,20160401,None,None,O,O,None,M,2012.0,09302016,None,None,AA,9.246846e+10,00199,B2

In [36]:
df_p.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200708 entries, 0 to 2200707
Data columns (total 28 columns):
 #   Column    Dtype
---  ------    -----
 0   cicid     float64
 1   i94yr     float64
 2   i94mon    float64
 3   i94cit    float64
 4   i94res    float64
 5   i94port   object
 6   arrdate   float64
 7   i94mode   float64
 8   i94addr   object
 9   depdate   float64
 10  i94bir    float64
 11  i94visa   float64
 12  count     float64
 13  dtadfile  object
 14  visapost  object
 15  occup     object
 16  entdepa   object
 17  entdepd   object
 18  entdepu   object
 19  matflag   object
 20  biryear   float64
 21  dtaddto   object
 22  gender    object
 23  insnum    object
 24  airline   object
 25  admnum    float64
 26  fltno     object
 27  visatype  object
dtypes: float64(13), object(15)
memory usage: 470.1+ MB

In [37]:
import pyarrow.parquet as pq
schema = pq.read_schema("/home/felipe/Documentos/Udacity/Data Engineering Nanodegree/Udacity_final_project/data/parquet_files/part-00000-b9542815-7a8d-45fc-9c67-c9c5007ad0d4-c000.snappy.parquet", memory_map=True)
print(list(schema.names))

['cicid', 'i94yr', 'i94mon', 'i94cit', 'i94res', 'i94port', 'arrdate', 'i94mode', 'i94addr', 'depdate', 'i94bir', 'i94visa', 'count', 'dtadfile', 'visapost', 'occup', 'entdepa', 'entdepd', 'entdepu', 'matflag', 'biryear', 'dtaddto', 'gender', 'insnum', 'airline', 'admnum', 'fltno', 'visatype']

In [38]:
schema.types

[DataType(double),
 DataType(double),
 DataType(double),
 DataType(double),
 DataType(double),
 DataType(string),
 DataType(double),
 DataType(double),
 DataType(string),
 DataType(double),
 DataType(double),
 DataType(double),
 DataType(double),
 DataType(string),
 DataType(string),
 DataType(string),
 DataType(string),
 DataType(string),
 DataType(string),
 DataType(string),
 DataType(double),
 DataType(string),
 DataType(string),
 DataType(string),
 DataType(string),
 DataType(double),
 DataType(string),
 DataType(string)]

In [4]:
len(df_p)

2200708

In [20]:
df_p['i94yr'].unique()

array([2016.])

In [21]:
df_p['i94mon'].unique()

array([4.])

## `I94_SAS_Labels_Descriptions`
To read this data I need to use something like this:<br>
https://knowledge.udacity.com/questions/125439

In [13]:
df_i04 =  pd.read_sas('/home/felipe/Documentos/Udacity/Data Engineering Nanodegree/Udacity_final_project/data/I94_SAS_Labels_Descriptions.SAS', format=None, index=None, encoding=None, chunksize=None, iterator=False)
df_i04.head()

ValueError: unable to infer format of SAS file from filename: '/home/felipe/documentos/udacity/data engineering nanodegree/udacity_final_project/data/i94_sas_labels_descriptions.sas'

## `imigration_data_sample.csv`

In [31]:
df_i = pd.read_csv('/home/felipe/Documentos/Udacity/Data Engineering Nanodegree/Udacity_final_project/data/immigration_data_sample.csv')
df_i.head()

,Unnamed: 0,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,2027561,4084316.0,2016.0,4.0,209.0,209.0,HHW,20566.0,1.0,HI,20573.0,61.0,2.0,1.0,20160422,NaN,NaN,G,O,NaN,M,1955.0,07202016,F,NaN,JL,5.658267e+10,00782,WT
1,2171295,4422636.0,2016.0,4.0,582.0,582.0,MCA,20567.0,1.0,TX,20568.0,26.0,2.0,1.0,20160423,MTR,NaN,G,R,NaN,M,1990.0,10222016,M,NaN,*GA,9.436200e+10,XBLNG,B2
2,589494,1195600.0,2016.0,4.0,148.0,112.0,OGG,20551.0,1.0,FL,20571.0,76.0,2.0,1.0,20160407,NaN,NaN,G,O,NaN,M,1940.0,07052016,M,NaN,LH,5.578047e+10,00464,WT
3,2631158,5291768.0,2016.0,4.0,297.0,297.0,LOS,20572.0,1.0,CA,20581.0,25.0,2.0,1.0,20160428,DOH,NaN,G,O,NaN,M,1991.0,10272016,M,NaN,QR,9.478970e+10,00739,B2
4,3032257,985523.0,2016.0,4.0,111.0,111.0,CHM,20550.0,3.0,NY,20553.0,19.0,2.0,1.0,20160406,NaN,NaN,Z,K,NaN,M,1997.0,07042016,F,NaN,NaN,4.232257e+10,LAND,WT

In [7]:
df_i.biryear.unique()

array([1955., 1990., 1940., 1991., 1997., 1965., 1968., 1983., 1977.,
       1981., 2012., 1944., 1962., 1954., 1982., 1986., 1995., 1973.,
       1970., 2002., 1976., 1975., 1994., 1952., 1999., 1974., 2000.,
       1989., 1960., 1984., 2008., 1957., 1978., 2006., 1951., 1964.,
       1985., 1958., 1950., 1988., 1948., 1972., 1987., 1980., 2004.,
       1956., 1998., 1953., 1996., 1966., 1992., 2010., 1943., 1945.,
       1969., 1979., 1967., 1938., 1961., 1963., 1947., 1993., 1936.,
       2005., 1941., 1932., 1971., 1959., 1949., 2015., 1939., 1946.,
       2011., 1928., 2013., 2001., 1933., 2003., 1935., 2014., 1923.,
       2007., 1929., 1942., 1931.])

In [8]:
df_i.i94cit.unique()

array([209., 582., 148., 297., 111., 577., 245., 113., 131., 116., 438.,
       260., 512., 689., 746., 115., 251., 268., 129., 213., 135., 133.,
       373., 126., 252., 696., 117., 687., 528., 123., 258., 691., 130.,
       107., 103., 694., 254., 574., 368., 575., 586., 734., 514., 273.,
       692., 109., 579., 164., 263., 464., 124., 602., 121., 162., 274.,
       690., 207., 104., 525., 105., 343., 576., 585., 272., 108., 114.,
       140., 180., 526., 603., 332., 513., 516., 218., 204., 296., 201.,
       257., 266., 520., 718., 112., 261., 299., 688., 141., 350., 340.])

In [4]:
df_i.cicid.unique()

array([4084316., 4422636., 1195600., 5291768.,  985523., 1481650.,
       2197173.,  232708., 5227851.,   13213., 1230572., 5056736.,
       2711583., 4916639., 1387607., 5960799., 1056530., 2466971.,
       4668286., 2556646., 4042798., 2139030., 3097076., 2741251.,
       2721962.,  513779., 3669540., 5070551., 2006623., 2826530.,
       5692439., 5835717., 2752883.,  239999., 4805034., 6055103.,
        216657., 2495693., 2929149., 4462449.,  800571.,  692716.,
       5472659.,  999282., 2572618., 4269184.,  861557., 2863583.,
       5973747., 4842142., 2955388., 1592228., 3108700., 5287221.,
       4455709.,   36661., 2655122., 2873671., 2053392.,  450692.,
       1840249., 4086972., 2686134., 4299497., 6030826., 3148387.,
       1787495., 2522724., 3293058., 4507487., 3599863.,  832555.,
       2351028., 4032526., 5418580.,  243918., 1186211., 4469436.,
       5234881., 5957654., 4243216., 2324901., 1435383., 2887088.,
       3335777., 1860945., 3371259., 1905596., 2138291., 1636545.,
       5270355., 5695448., 5021687., 3681899.,   95870., 2653900.,
       2002746.,  289809., 4969309., 3364934., 1843262., 6053964.,
       2027276.,  650850., 2926213., 2892078., 4231176., 3172408.,
       5044435., 5756066., 1028660.,  811826.,   13208., 2295923.,
        935114., 5883463., 3178503., 5097572.,  680812., 5759722.,
       1602004.,  267021., 3111179., 1643294., 3502393., 5008746.,
       1346007., 4732257., 1093165., 2720247., 3652711., 3845208.,
       2514747., 3686758., 5475279.,  975537., 3147418., 4865466.,
       3898468., 3001596.,   80353., 5245089., 5979647., 4407381.,
       4537062., 2301889., 1408683., 2161755.,   13826.,  660066.,
       2369303.,  873857., 3814096.,  835775., 2914164., 5133426.,
       4025365., 4255430., 2943425., 4709156., 1006905., 2859612.,
         22388.,   17786., 3529728., 4499590., 1999678.,  475483.,
       1389098., 5284360.,  354216., 5500240., 2870032.,   54324.,
       5135218., 4406725., 2473547.,  688605., 1379698., 1396100.,
       2711123., 3636229., 6058513., 2343856., 5492918., 4866976.,
       3507228., 5913269., 4526989., 1496112., 5062245., 5016696.,
       3106766., 2489526.,  687285., 4874583.,  512308., 4024419.,
       3076465., 3475529., 1217552., 2353538., 3554693., 2023436.,
       5032473., 4912411., 5014510., 2489005., 1936298.,  997142.,
        864073., 5644410., 5881744., 2615091., 3649436.,   25478.,
       1604063., 5000485., 5034128., 2755321., 5136021., 3664296.,
        276351., 4876422., 5231114., 3123550.,  684429., 5488331.,
        237254., 5278774., 5515091., 5469766., 5651108., 5454506.,
       4806300.,  879820.,  834035.,  452796.,  513953., 3493719.,
       2209495.,  847150., 2867437., 4560971.,   86265., 3639514.,
       1147049., 5092679.,  224390., 4879567., 2175688., 2920807.,
       4459037., 5901083., 6028314., 2913751., 5899181., 2368032.,
       4741049., 5974385.,  235326.,  235947., 2305457., 2323011.,
       4187631., 3898364.,   81344., 1362272., 4017499.,  696029.,
        510204., 4348794., 1040289., 2509310., 2209111., 1347695.,
       3722852., 5957963., 2735489., 2051330., 1046624., 5193362.,
       4526006., 5483093., 4319371., 2573307., 4700630., 3661175.,
       4210478., 1768810., 2751598., 3669469., 2013603., 4490715.,
       3426228.,  255177.,  559860., 4167704., 4668071., 2903779.,
       1216269., 4268549., 3140598., 2938927.,  287911., 2932211.,
       3846710., 1540610., 1048108., 2378019., 5662583., 5826788.,
       3859552.,  969559., 3476890., 1421234.,   48659., 3136802.,
       5450392.,   61611., 2737342.,  445587., 1983761.,   45531.,
       6019883., 5250382., 2487808., 4498036., 2572103., 1864244.,
       2326063., 5927858., 4178297., 3861001., 4013399., 4098212.,
       4338665., 5514177., 3898900., 3552753., 1782513., 1376054.,
       5097840., 3726176., 1863656., 1776348., 5696484., 3813900.,
        229043., 2137931., 2908117., 1803491., 4494327., 1143832.,
       4267184., 1026490., 4487041., 1339481., 5693192., 3886754.,
       1002291., 3905922., 1991822., 1046737., 3085571., 2011700.,
       1173719.,  715185., 5963414., 2652805., 1858517., 6057910.,
       5980604., 5653283., 4697112., 4116633.,  685207., 2053904.,
       5243784., 3886516., 5074129., 4082575., 1851628., 3110964.,
       5891340., 1553590., 1577711.,  867033., 2520663., 5710005.,
       3542252., 5679004., 1649166., 2209939.,  467207., 5832309.,
         86281., 5301075., 3866997.,  211561., 3334127., 1428778.,
       1420768., 4547068.,  820045., 3112694., 2706307., 2955651.,
        626444., 3442997., 5660225., 4885133., 5470326., 2319989.,
       2720964., 1400880., 4038162., 2723913., 3914231., 5982639.,
        982263., 1330915., 4842948., 3765424., 2568615., 1624057.,
       4538779., 1826960., 2216875., 3859178., 5760102., 1195419.,
        647849., 4505923.,   87211., 3543377., 5951265., 2346741.,
       5500649., 3891814., 6045611., 2165928., 1817106., 4338296.,
        701007., 2683469., 4525494., 4745361., 2371488., 3551626.,
       4916874., 4800385., 2901425., 2378775., 1999393., 1393049.,
       3145084., 4251217., 3172891.,  284782., 4913166., 1181033.,
       3481574., 3547150., 4877203., 1553520., 2195092., 3064434.,
       2147566., 1803405., 4054245., 2477529., 3549552., 2635148.,
       5210254., 1422091., 5665973., 5956950., 1401034., 3682251.,
       4698239., 2258431., 3155905.,  641842., 4406370., 6019750.,
       4877171., 3343735., 5206051., 4702607., 1034637., 4321597.,
       5342910., 1583932., 4518344.,  691843., 2758683., 5415601.,
       5472156., 5484369., 2865828.,  211301., 2759806., 5517803.,
         19751.,  624009., 4116830., 1195982., 1498315., 4913292.,
       3865265., 3385048., 5698234., 4616564., 5703109., 2424686.,
       2168671., 1170620., 1351033., 3341644., 2762951.,  714371.,
       1413332., 3530227., 1020076., 2679743., 3253815., 4866124.,
       1636523.,  838246., 1960284.,  485199., 1600731., 4317940.,
       1921440., 3811781., 3599914., 1434452.,  494733., 2038184.,
       2865787., 2107301., 5688796.,  852513., 5516452.,  261165.,
       5293311., 2902077.,   38637.,  157256., 1606014., 3849271.,
       4718538., 4909999., 5428448., 2161628., 5029772., 1564821.,
       4337016., 1977165., 3174311., 2897919., 2869687., 5451416.,
        630827., 2139998., 3141666., 4030833., 3380572., 4522231.,
       4289482.,  636324., 2048872., 2933588., 3331441., 2307913.,
       4756602., 3155478.,  243257.,  862818., 6009632., 1570667.,
       4248046., 3300843., 1036934., 5750198., 2906098., 4243068.,
       5273693.,  253555.,   48878.,  509225., 3959662., 4236787.,
       5827765.,  471394., 1848870., 2025435., 3910822., 3888676.,
       3299598., 5252852., 2511828.,  523239., 1809655., 5020014.,
       5655662., 4698964., 5072687., 5133973.,  751810., 3095246.,
       1390539.,  266409., 1231815.,  499578., 1969525., 5252446.,
         54317., 2690389.,   45157., 5771544., 2292245., 1794308.,
        293362., 2734662., 5963522., 1346274., 3640076., 1721456.,
       5653917., 1232357.,   54229., 1345803.,  652881., 2469865.,
       3115632., 4718122., 1566033., 5886229., 3179870.,  699077.,
        824863., 5678526.,  352846.,  298424., 4851069., 5961217.,
       3507607., 1383491.,  867234., 4625869., 5032769., 3139866.,
       1334404., 5979347., 5640026., 2658696., 5250285., 1695849.,
       5638801., 3655992., 4804280., 5021720., 2907046.,   32582.,
       3656427., 1025877., 1345422., 2308338., 1170649.,  878052.,
       5999391.,  442028., 3517920.,  257403., 5516418., 4116530.,
        263870., 6061994., 5902022., 1349112., 2656268., 5064157.,
       4552209., 5757922., 4718060.,  751451., 2340245., 1648938.,
        480428., 5827717.,   56107., 3503887., 6034994., 2051443.,
       4231640., 1870573., 3543194., 3106819., 2372111., 1331768.,
        155381., 5011988., 1053226., 6055844., 2814946.,  840431.,
       5020169., 2330915., 2496533.,  169126., 3119472., 1794581.,
       1793960., 2293512., 4903433., 1583343., 3636527., 4340220.,
       3675104., 2142356., 3859815., 2187824., 2892590., 3108923.,
       5835261., 5974788., 3135817., 1278563., 1975402., 6034750.,
        823410., 5430874., 4489534., 5026709., 5441846.,  275285.,
       5687991.,  514906., 2327918., 3838865., 5965743., 5206668.,
       5285085., 4711317., 3434626.,  682147., 3069265., 1044320.,
       3854905.,  697792., 6027626.,  215616., 3330175., 2011996.,
       5471104., 2763068., 3098965., 2948769.,  289649.,  813390.,
       3071228., 2956283., 2882086., 1560415., 4893326., 2006895.,
       3697368., 1964434.,   67523., 2512913., 3326716.,  751491.,
       5591745., 2884981., 5882487.,   56519., 3017841.,  502445.,
       5253767.,  994837., 3291050., 5643776.,   91889., 5429441.,
       3652390., 4899947., 4291831., 1782990., 4051263., 4106787.,
       2021799., 4078254., 2023167.,  442884., 1577932., 4471633.,
       2693162., 5081528., 2673594., 1714703., 1182448.,  712131.,
       4749124., 4456287., 5834016., 1333584., 4737343.,  561992.,
       5724253., 1344231., 4489316., 3869924., 4729596., 3900131.,
       1193133., 3907700., 5226618., 5892575., 3292986., 4168875.,
       3162474.,  662899., 4525560., 5069811., 2468972.,  858814.,
        621527., 2318687., 3352680.,  431930., 2810765., 5248600.,
       3661015., 3863510.,  247003., 5418335., 5928244., 1051236.,
       5295362., 2928372., 5714054., 2486203., 5246711., 4344944.,
        628369., 1037028.,  982461., 4865286., 5411783., 5270782.,
       4273827.,  886260., 1006956., 1214788., 2320039., 3837135.,
       1163269.,  264030., 2758084., 5365953.,  888522., 2007033.,
       2884459., 1366324., 1772879.,   18310.,  934333., 5402467.,
       2369222., 5714501., 2876316., 2497179., 1799852., 3083727.,
       5680234., 1632631.,  594975., 6046172., 3826085.,  428602.,
       4753503.,   34343., 3835875., 2167869., 3548734.,  642558.,
       3652687., 3360046.,   32221., 4300706., 1215382., 6057882.,
       4511860.,   80898., 3387259.,  991350., 1040218., 1232307.,
       3425763., 2933080., 5516628., 2362315., 1598903., 5713141.,
       5735642., 5673587., 4882428., 2546113., 5731122., 2709302.,
       1225506.,  435495., 5512209., 1364080., 5292921., 2496521.,
       4739992.,  706970., 5762766., 5002887., 4541593., 5707240.,
       4043656., 2859914.,  307397., 1760330., 3506997., 3029600.,
        873211., 4302956., 5429364.,  252362., 5743519., 3481453.,
        446046., 2751431., 1211380.,  441018., 2825582., 3078710.,
        852702., 5724005., 1016822., 5928085., 2479583., 3484147.,
       2012102., 5446642., 1369267., 5015059., 5258247., 3477144.,
       4693164., 3468375., 5358837., 5646741., 3079773., 2916461.,
       3535501., 5433584., 2756515., 1984857.,  692088., 3501748.,
       2557045.,  674661.,  499823., 2536368., 1185184., 4889422.,
       1032729., 4687494., 3870400., 1355619., 5018908., 4853913.,
       3691189., 1000074., 5746779., 3187040., 2302459., 1481945.,
       3133114., 5510883., 5518986.,  306972., 1407986., 1360834.,
       5242730., 1777652., 3874218.,  930868., 5081809., 4288772.,
       2947585., 2883298., 2264857., 4654865.])

In [15]:
df_i[~df_i['insnum'].isnull()].head(5)

,Unnamed: 0,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
15,2938436,5960799.0,2016.0,4.0,245.0,245.0,SAI,20545.0,1.0,NaN,20550.0,30.0,2.0,1.0,20160615,NaN,NaN,P,D,NaN,M,1986.0,04132016,M,3882.0,MU,4.416258e+10,00763,CP
35,3020206,6055103.0,2016.0,4.0,252.0,209.0,AGA,20572.0,1.0,GU,20577.0,27.0,2.0,1.0,20160801,NaN,NaN,A,D,NaN,M,1989.0,06112016,M,3943.0,TW,5.109649e+10,00311,GMT
48,2951108,5973747.0,2016.0,4.0,252.0,209.0,SAI,20552.0,1.0,NaN,20554.0,65.0,2.0,1.0,20160615,NaN,NaN,A,D,NaN,M,1951.0,05222016,M,3971.0,DL,4.729111e+10,00298,GMT
79,2937355,5957654.0,2016.0,4.0,254.0,276.0,SAI,20556.0,1.0,GU,NaN,20.0,2.0,1.0,20160610,NaN,NaN,A,NaN,NaN,NaN,1996.0,05262016,M,3993.0,7C,4.511468e+10,03404,GMT
101,3019076,6053964.0,2016.0,4.0,252.0,209.0,AGA,20546.0,1.0,GU,20583.0,6.0,2.0,1.0,20160801,NaN,NaN,A,D,NaN,M,2010.0,06152016,M,3691.0,JL,5.752208e+10,00473,GMT

In [8]:
df_i.columns

Index(['Unnamed: 0', 'cicid', 'i94yr', 'i94mon', 'i94cit', 'i94res', 'i94port',
       'arrdate', 'i94mode', 'i94addr', 'depdate', 'i94bir', 'i94visa',
       'count', 'dtadfile', 'visapost', 'occup', 'entdepa', 'entdepd',
       'entdepu', 'matflag', 'biryear', 'dtaddto', 'gender', 'insnum',
       'airline', 'admnum', 'fltno', 'visatype'],
      dtype='object')

In [10]:
df_i.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 29 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1000 non-null   int64
 1   cicid       1000 non-null   float64
 2   i94yr       1000 non-null   float64
 3   i94mon      1000 non-null   float64
 4   i94cit      1000 non-null   float64
 5   i94res      1000 non-null   float64
 6   i94port     1000 non-null   object
 7   arrdate     1000 non-null   float64
 8   i94mode     1000 non-null   float64
 9   i94addr     941 non-null    object
 10  depdate     951 non-null    float64
 11  i94bir      1000 non-null   float64
 12  i94visa     1000 non-null   float64
 13  count       1000 non-null   float64
 14  dtadfile    1000 non-null   int64
 15  visapost    382 non-null    object
 16  occup       4 non-null      object
 17  entdepa     1000 non-null   object
 18  entdepd     954 non-null    object
 19  entdepu     0 non-null      float64
 20  matflag     954 non-null    object
 21  biryear     1000 non-null   float64
 22  dtaddto     1000 non-null   object
 23  gender      859 non-null    object
 24  insnum      35 non-null     float64
 25  airline     967 non-null    object
 26  admnum      1000 non-null   float64
 27  fltno       992 non-null    object
 28  visatype    1000 non-null   object
dtypes: float64(15), int64(2), object(12)
memory usage: 226.7+ KB

When we take a look at the columns `count` and `cicid` to check for unique values and duplicates we can see that the `cicid` column can be used as key for information of imigrant dimension table.

In [5]:
df_i['count'].unique()

array([1.])

In [7]:
df_i.groupby(['cicid'])['cicid'].count().sort_index(ascending=False)

cicid
6061994.0    1
6058513.0    1
6057910.0    1
6057882.0    1
6055844.0    1
            ..
18310.0      1
17786.0      1
13826.0      1
13213.0      1
13208.0      1
Name: cicid, Length: 1000, dtype: int64

In [10]:
df_i.groupby(['Unnamed: 0'])['Unnamed: 0'].count().sort_index(ascending=False)

Unnamed: 0
3095749    1
3091119    1
3089516    1
3089082    1
3087594    1
          ..
15053      1
14575      1
11328      1
10930      1
10925      1
Name: Unnamed: 0, Length: 1000, dtype: int64

In [6]:
df_i.occup.unique()

array([nan, 'STU', 'PHA', 'OTH'], dtype=object)

In [7]:
df_i.entdepa.unique()

array(['G', 'Z', 'T', 'O', 'P', 'A', 'K', 'U', 'H'], dtype=object)

In [8]:
df_i.entdepd.unique()

array(['O', 'R', 'K', 'N', 'D', nan, 'I', 'Q', 'J', 'W', 'L'],
      dtype=object)

In [10]:
df_i.matflag.unique()

array(['M', nan], dtype=object)

In [11]:
df_i.visapost.unique()

array([nan, 'MTR', 'DOH', 'MNL', 'NSS', 'MOS', 'TLV', 'MDR', 'MEX', 'IST',
       'CPT', 'CRS', 'DUB', 'SPL', 'BNS', 'BEJ', 'TGG', 'RDJ', 'CLG',
       'NWD', 'BGT', 'KRK', 'VNN', 'LMA', 'CRO', 'SNJ', 'GUZ', 'KNG',
       'BEN', 'KLL', 'QTO', 'CHE', 'GTM', 'SGP', 'BRA', 'HYD', 'MNG',
       'SHG', 'SAR', 'BNK', 'BMB', 'ACK', 'WRW', 'NVL', 'PRM', 'KEV',
       'TAI', 'DHK', 'JDD', 'SPT', 'SAJ', 'SOF', 'SNS', 'VAC', 'SDO',
       'KWT', 'GDL', 'SNT', 'CHN', 'GEO', 'ABU', 'BGN', 'RCF', 'PTS',
       'GYQ', 'NCS', 'RID', 'SYD', 'MTM', 'JAK', 'ABD', 'KRC', 'PHP',
       'MER', 'LND', 'PRS', 'KDU', 'MST', 'RME', 'SEO', 'JRS', 'HNK',
       'RNG', 'CDJ', 'ULN', 'ISL', 'LPZ', 'KHT', 'ANK', 'CSB', 'LGS',
       'FRN', 'NRB', 'CUS', 'PTP', 'VIL', 'TKY', 'HML'], dtype=object)

In [8]:
print(df_i.arrdate.min())
print(df_i.arrdate.max())

20545.0
20574.0

In [9]:
df_i.occup.unique()

array([nan, 'STU', 'PHA', 'OTH'], dtype=object)

In [10]:
df_i.entdepu.unique()

array([nan])

In [11]:
df_i.insnum.unique()

array([  nan, 3882., 3943., 3971., 3993., 3691., 3693., 3979., 3468.,
       3969., 3668., 3517., 3895., 3940., 3954., 3982., 3663., 3930.,
       4686., 3661., 3872., 3887., 3703., 3941., 3682., 3675., 3934.,
       3890., 3576., 3980.])

## `airport-codes_csv.csv`

In [3]:
df_a = pd.read_csv('/home/felipe/Documentos/Udacity/Data Engineering Nanodegree/Udacity_final_project/data/airport-codes_csv.csv')
df_a.head()

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
0,00A,heliport,Total Rf Heliport,11.0,NaN,US,US-PA,Bensalem,00A,NaN,00A,"-74.93360137939453, 40.07080078125"
1,00AA,small_airport,Aero B Ranch Airport,3435.0,NaN,US,US-KS,Leoti,00AA,NaN,00AA,"-101.473911, 38.704022"
2,00AK,small_airport,Lowell Field,450.0,NaN,US,US-AK,Anchor Point,00AK,NaN,00AK,"-151.695999146, 59.94919968"
3,00AL,small_airport,Epps Airpark,820.0,NaN,US,US-AL,Harvest,00AL,NaN,00AL,"-86.77030181884766, 34.86479949951172"
4,00AR,closed,Newport Hospital & Clinic Heliport,237.0,NaN,US,US-AR,Newport,NaN,NaN,NaN,"-91.254898, 35.6087"

In [4]:
len(df_a.iata_code.unique())

9043

In [5]:
df_a.continent.unique()

array([nan, 'OC', 'AF', 'AN', 'EU', 'AS', 'SA'], dtype=object)

In [6]:
df_a.local_code.unique()

array(['00A', '00AA', '00AK', ..., 'FAWT', 'ZEN', 'ZNC'], dtype=object)

In [7]:
df_a[df_a['iata_code'] == 'MCA']

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
22740,GUMA,small_airport,Macenta Airport,1690.0,AF,GN,GN-N,Macenta,GUMA,MCA,NaN,"-9.525071, 8.481857"

In [8]:
df_a.type.unique()

array(['heliport', 'small_airport', 'closed', 'seaplane_base',
       'balloonport', 'medium_airport', 'large_airport'], dtype=object)

In case we choose to use the `iata_code` as a key, we should pay attention to duplicate records.

In [9]:
df_a.groupby('iata_code')['iata_code'].count().sort_values(ascending=False)

iata_code
0      80
OHE     3
PRI     3
BCK     2
CLG     2
       ..
HMA     1
HLZ     1
HLW     1
HLV     1
ZZV     1
Name: iata_code, Length: 9042, dtype: int64

In [10]:
df_a[df_a['iata_code'] == 'OHE']

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
15089,CN-0011,closed,[Duplicate] Gu-Lian Airport,1836.0,AS,CN,CN-23,Mohe,ZYMH,OHE,NaN,"122.427768, 52.913917"
37384,OHE,closed,[Duplicate] Gu-Lian Airport,1836.0,AS,CN,CN-23,Mohe,ZYMH,OHE,NaN,"122.429056, 52.913244"
55062,ZYMH,medium_airport,Gu-Lian Airport,1836.0,AS,CN,CN-23,Mohe,ZYMH,OHE,NaN,"122.43, 52.912777777799995"

Even though we get only the airports with type other than 'closed' we will still face duplicate records.

In [11]:
df_a[df_a['type'] != 'closed'].groupby('iata_code')['iata_code'].count().sort_values(ascending=False)

iata_code
0      80
RCH     2
LPE     2
MRE     2
PRM     2
       ..
HLT     1
HLS     1
HLR     1
HLP     1
ZZV     1
Name: iata_code, Length: 8798, dtype: int64

In [12]:
df_a[df_a['iata_code'] == 'RCH']

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
44593,SKRH,medium_airport,Almirante Padilla Airport,43.0,SA,CO,CO-LAG,Riohacha,SKRH,RCH,RCH,"-72.926, 11.5262"
50421,UY-0002,small_airport,Rocha Airport,91.0,SA,UY,UY-RO,Rocha,NaN,RCH,NaN,"-54.27989959716797, -34.47809982299805"

Looking for airports with more then one `iata_code`.

In [13]:
df_a1 = df_a[~df_a['iata_code'].isnull()].groupby('iata_code')['name'].count().sort_values(ascending=False).reset_index()
df_a1.head()

  iata_code  name
0         0    80
1       OHE     3
2       PRI     3
3       BCK     2
4       CLG     2

In [14]:
df_a2 = df_a1[df_a1['name'] >1]
df_a2.head()

  iata_code  name
0         0    80
1       OHE     3
2       PRI     3
3       BCK     2
4       CLG     2

We will have to remove `iata_code` = 0.

In [15]:
df_a3 = df_a2[df_a2['iata_code'] != '0']
df_a3.head()

  iata_code  name
1       OHE     3
2       PRI     3
3       BCK     2
4       CLG     2
5       RTI     2

List containing all duplicate `iata_codes`.

In [16]:
dup_iata = df_a3.iata_code.to_list()

Looking at the registers below we can see some airport names with the prefix "\[Duplicate]" in the `name` column.

In [17]:
df_a[df_a['iata_code'] == 'OHE']

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
15089,CN-0011,closed,[Duplicate] Gu-Lian Airport,1836.0,AS,CN,CN-23,Mohe,ZYMH,OHE,NaN,"122.427768, 52.913917"
37384,OHE,closed,[Duplicate] Gu-Lian Airport,1836.0,AS,CN,CN-23,Mohe,ZYMH,OHE,NaN,"122.429056, 52.913244"
55062,ZYMH,medium_airport,Gu-Lian Airport,1836.0,AS,CN,CN-23,Mohe,ZYMH,OHE,NaN,"122.43, 52.912777777799995"

So, we need to check if all the iata codes in dup_iata list behaves the same way.

In [18]:
# 66 cases....
len(dup_iata)

66

Filtering all duplicated names.

In [19]:
df_a_dup = df_a[df_a['name'].str.startswith('[Duplicate]')]
df_a_dup.head()

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
2331,1W5,closed,[Duplicate] Hoby Wolf Airport,600.0,NaN,US,US-MD,Eldersburg,1W5,NaN,1W5,"-76.9274978638, 39.4079017639"
4191,3C5,closed,[Duplicate] Wheeler Airport,720.0,NaN,US,US-IN,Knox,3C5,NaN,3C5,"-86.60700225830001, 41.1898002625"
10769,AR-0006,closed,[Duplicate] Brigadier Hector Ruiz Airport,228.0,SA,AR,AR-B,Coronel Suarez,NaN,CSZ,NaN,"-61.8833007812, -37.4333000183"
11564,AU-0051,closed,[Duplicate] Baralaba,340.0,OC,AU,AU-QLD,Baralaba,YBAB,NaN,NaN,"149.843166, -24.19357"
11637,AU-BCK,closed,[Duplicate] Bolwarra Airport,NaN,OC,AU,AU-QLD,Bolwarra,NaN,BCK,NaN,"144.169006348, -17.388299942"

Removing the ones where iata_code is null.

In [20]:
df_a_dup_not_null = df_a_dup[~df_a_dup['iata_code'].isnull()]
df_a_dup_not_null.head()

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
10769,AR-0006,closed,[Duplicate] Brigadier Hector Ruiz Airport,228.0,SA,AR,AR-B,Coronel Suarez,NaN,CSZ,NaN,"-61.8833007812, -37.4333000183"
11637,AU-BCK,closed,[Duplicate] Bolwarra Airport,NaN,OC,AU,AU-QLD,Bolwarra,NaN,BCK,NaN,"144.169006348, -17.388299942"
11638,AU-BFC,closed,[Duplicate] Bloomfield Airport,66.0,OC,AU,AU-QLD,Bloomfield,NaN,BFC,NaN,"145.330001831, -15.8736000061"
11639,AU-BVW,closed,[Duplicate] Batavia Downs Airport,NaN,OC,AU,AU-QLD,Batavia Downs,NaN,BVW,NaN,"142.675003052, -12.6591997147"
11642,AU-CQP,closed,[Duplicate] Cape Flattery Airport,NaN,OC,AU,AU-QLD,Cape Flattery,NaN,CQP,NaN,"145.311004639, -14.9709997177"

How many duplicated iata_code there are now?

In [21]:
len(df_a_dup_not_null['iata_code'].to_list())

24

I ran all the codes and generated the informations on Redshift and still found duplicates there on `dim_port` using this query:<br>
```sql
SELECT
    port_id,
    COUNT(port_id) AS count_id
FROM dim_port
GROUP BY 1
ORDER BY 2 DESC
```
Let's take a look at those ids....<br>
Looking at these cases below we can see that that are no duplicates for this registers in the `staging_airport_codes`.<br>
So, I will have to look at the query that generates the table `dim_port`.

In [24]:
duplicate_port_id = ['LOS', 'MIA', 'SFR', 'HOU', 'DEN', 'TAM', 'SNA']
df_a[df_a['iata_code'] == 'LOS']

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
17551,DNMM,large_airport,Murtala Muhammed International Airport,135.0,AF,NG,NG-LA,Lagos,DNMM,LOS,NaN,"3.321160078048706, 6.5773701667785645"

In [25]:
df_a[df_a['iata_code'] == 'MIA']

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
28044,KMIA,large_airport,Miami International Airport,8.0,NaN,US,US-FL,Miami,KMIA,MIA,MIA,"-80.29060363769531, 25.79319953918457"

In [26]:
df_a[df_a['iata_code'] == 'SFR']

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
42481,SFR,closed,San Fernando Airport,1168.0,NaN,US,US-CA,Los Angeles,NaN,SFR,NaN,"-118.422, 34.289"

In [27]:
df_a[df_a['iata_code'] == 'HOU']

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
27500,KHOU,large_airport,William P Hobby Airport,46.0,NaN,US,US-TX,Houston,KHOU,HOU,HOU,"-95.27890015, 29.64539909"

In [28]:
df_a[df_a['iata_code'] == 'DEN']

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
26558,KDEN,large_airport,Denver International Airport,5431.0,NaN,US,US-CO,Denver,KDEN,DEN,DEN,"-104.672996521, 39.861698150635"

In [29]:
df_a[df_a['iata_code'] == 'TAM']

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
33415,MMTM,medium_airport,General Francisco Javier Mina International Ai...,80.0,NaN,MX,MX-TAM,Tampico,MMTM,TAM,NaN,"-97.8658981323, 22.2964000702"

In [30]:
df_a[df_a['iata_code'] == 'SNA']

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
29989,KSNA,large_airport,John Wayne Airport-Orange County Airport,56.0,NaN,US,US-CA,Santa Ana,KSNA,SNA,SNA,"-117.8679962, 33.67570114"

Since we have duplicates for this cities, we have to take a look at the imigration table to see if there are imigrants arriving at this cities by another modal type.

In [32]:
df_i.columns

Index(['Unnamed: 0', 'cicid', 'i94yr', 'i94mon', 'i94cit', 'i94res', 'i94port',
       'arrdate', 'i94mode', 'i94addr', 'depdate', 'i94bir', 'i94visa',
       'count', 'dtadfile', 'visapost', 'occup', 'entdepa', 'entdepd',
       'entdepu', 'matflag', 'biryear', 'dtaddto', 'gender', 'insnum',
       'airline', 'admnum', 'fltno', 'visatype'],
      dtype='object')

In [34]:
df_i[df_i['i94port'].isin(duplicate_port_id)].groupby(['i94port', 'i94mode'])['cicid'].count().sort_values(ascending=False)

i94port  i94mode
MIA      1.0        110
LOS      1.0        104
SFR      1.0         54
HOU      1.0         30
TAM      1.0         10
DEN      1.0          2
TAM      3.0          2
DEN      2.0          1
HOU      3.0          1
LOS      2.0          1
         9.0          1
MIA      2.0          1
SFR      3.0          1
SNA      1.0          1
         2.0          1
Name: cicid, dtype: int64

Since in imigration table we have arrival by more then one type of mode and in airport dataset we only have the air modal, we have to adjust the join in the query so we do not duplicate the registers.<br>

The ports with dupicate keys on `dim_port` tables are due to the fact that there are more than one port with the same id, but with different modal of transportation. So, it is not possible to have the `port_id` column as a key for this table. To solve this problem we will have to create a new key based on the concatenation of port_id and modal_id. The final result will be a key that looks like: 'AAA_1', 'AAA_3'.

## `sas_desciptive_information.csv`

In [4]:
df_sas = pd.read_csv('/home/felipe/Documentos/Udacity/Data Engineering Nanodegree/Udacity_final_project/data/sas_descriptive_information.csv', delimiter='|')
df_sas.head()

    id                                        description      column
0  582  MEXICO Air Sea, and Not Reported (I-94, no lan...  i94cit_res
1  236                                        AFGHANISTAN  i94cit_res
2  101                                            ALBANIA  i94cit_res
3  316                                            ALGERIA  i94cit_res
4  102                                            ANDORRA  i94cit_res

In [5]:
df_sas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1011 entries, 0 to 1010
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           1011 non-null   object
 1   description  1011 non-null   object
 2   column       1011 non-null   object
dtypes: object(3)
memory usage: 23.8+ KB

In [12]:
df_sas.column.unique()

array(['i94cit_res', 'i94port', 'i94mode', 'i94addr', 'i94visa'],
      dtype=object)

In [12]:
df_sas.groupby('id')['id'].count().sort_values(ascending=False)

id
3      2
1      2
2      2
MAL    1
MBO    1
      ..
ATB    1
ATL    1
ATW    1
AUH    1
ZZZ    1
Name: id, Length: 1008, dtype: int64

In [13]:
df_sas.groupby('description')['description'].count().sort_values(ascending=False)

description
CANNON CORNERS, NY        2
AKRON, OH                 2
INVALID: STATELESS        2
Collapsed into INT, MN    2
INVALID: UNITED STATES    2
                         ..
HARLINGEN, TX             1
HARRISBURG, PA            1
HARRISONBURG, PA          1
HARTFORD, CT              1
ZIMBABWE                  1
Name: description, Length: 1001, dtype: int64

In [14]:
df_sas[df_sas['description'] == 'CANNON CORNERS, NY']

      id         description   column
603  CNH  CANNON CORNERS, NY  i94port
866  CNC  CANNON CORNERS, NY  i94port

In [ ]:
df_sas[df_sas['description'] == 'CANNON CORNERS, NY']

### Do these (`i94cit_res`, `i94addr`) tables present the same information?
The `i94addr` is consisted of **United States states** and **some places like 'Virgin Island', 'Guam', 'Puerto Rico', 'All Other Codes'**.<br>
THe `i94cit_res` are **countries**.

In [15]:
df_cit = df_sas[df_sas['column'] == 'i94cit_res']
df_add = df_sas[df_sas['column'] == 'i94addr']

In [14]:
print('len df_cit: ', len(df_cit))
print('len df_add: ', len(df_add))

len df_cit:  289
len df_add:  55

In [15]:
df_cit.head()

    id                                        description      column
0  582  MEXICO Air Sea, and Not Reported (I-94, no lan...  i94cit_res
1  236                                        AFGHANISTAN  i94cit_res
2  101                                            ALBANIA  i94cit_res
3  316                                            ALGERIA  i94cit_res
4  102                                            ANDORRA  i94cit_res

In [16]:
df_add.head()

     id description   column
953  AL     ALABAMA  i94addr
954  AK      ALASKA  i94addr
955  AZ     ARIZONA  i94addr
956  AR    ARKANSAS  i94addr
957  CA  CALIFORNIA  i94addr

In [19]:
df_add.description.unique()

array(['ALABAMA', 'ALASKA', 'ARIZONA', 'ARKANSAS', 'CALIFORNIA',
       'COLORADO', 'CONNECTICUT', 'DELAWARE', 'DIST. OF COLUMBIA',
       'FLORIDA', 'GEORGIA', 'GUAM', 'HAWAII', 'IDAHO', 'ILLINOIS',
       'INDIANA', 'IOWA', 'KANSAS', 'KENTUCKY', 'LOUISIANA', 'MAINE',
       'MARYLAND', 'MASSACHUSETTS', 'MICHIGAN', 'MINNESOTA',
       'MISSISSIPPI', 'MISSOURI', 'MONTANA', 'N. CAROLINA', 'N. DAKOTA',
       'NEBRASKA', 'NEVADA', 'NEW HAMPSHIRE', 'NEW JERSEY', 'NEW MEXICO',
       'NEW YORK', 'OHIO', 'OKLAHOMA', 'OREGON', 'PENNSYLVANIA',
       'PUERTO RICO', 'RHODE ISLAND', 'S. CAROLINA', 'S. DAKOTA',
       'TENNESSEE', 'TEXAS', 'UTAH', 'VERMONT', 'VIRGIN ISLANDS',
       'VIRGINIA', 'W. VIRGINIA', 'WASHINGTON', 'WISCONSON', 'WYOMING',
       'All Other Codes'], dtype=object)

In [21]:
df_add[df_add['description'].isin(['GUAM', 'PUERTO RICO', 'VIRGIN ISLANDS', 'All Other Codes'])]

      id      description   column
964   GU             GUAM  i94addr
993   PR      PUERTO RICO  i94addr
1001  VI   VIRGIN ISLANDS  i94addr
1007  99  All Other Codes  i94addr

In [23]:
len(df_add[~df_add['description'].isin(['GUAM', 'PUERTO RICO', 'VIRGIN ISLANDS', 'All Other Codes'])])

51

In [20]:
df_cit.description.unique()

array(['MEXICO Air Sea, and Not Reported (I-94, no land arrivals)',
       'AFGHANISTAN', 'ALBANIA', 'ALGERIA', 'ANDORRA', 'ANGOLA',
       'ANGUILLA', 'ANTIGUA-BARBUDA', 'ARGENTINA', 'ARMENIA', 'ARUBA',
       'AUSTRALIA', 'AUSTRIA', 'AZERBAIJAN', 'BAHAMAS', 'BAHRAIN',
       'BANGLADESH', 'BARBADOS', 'BELGIUM', 'BELIZE', 'BENIN', 'BERMUDA',
       'BELARUS', 'BHUTAN', 'BOLIVIA', 'BONAIRE, ST EUSTATIUS, SABA',
       'BOSNIA-HERZEGOVINA', 'BOTSWANA', 'BRAZIL',
       'BRITISH VIRGIN ISLANDS', 'BRUNEI', 'BULGARIA', 'BURKINA FASO',
       'BURMA', 'BURUNDI', 'CAMEROON', 'CAPE VERDE', 'CAYMAN ISLANDS',
       'CENTRAL AFRICAN REPUBLIC', 'CHAD', 'CHILE', 'CHINA, PRC',
       'CURACAO', 'CHRISTMAS ISLAND', 'COCOS ISLANDS', 'COLOMBIA',
       'COMOROS', 'CONGO', 'COOK ISLANDS', 'COSTA RICA', 'CROATIA',
       'CUBA', 'CYPRUS', 'CZECH REPUBLIC',
       'FAROE ISLANDS (PART OF DENMARK)', 'DENMARK', 'DJIBOUTI',
       'DOMINICA', 'DOMINICAN REPUBLIC', 'EAST TIMOR', 'ECUADOR', 'EGYPT',
       'EL SALVADOR', 'EQUATORIAL GUINEA', 'ERITREA', 'ESTONIA',
       'ETHIOPIA', 'FALKLAND ISLANDS', 'FIJI', 'FINLAND', 'FRANCE',
       'FRENCH GUIANA', 'FRENCH POLYNESIA', 'GABON', 'GAMBIA',
       'GAZA STRIP', 'GEORGIA', 'GERMANY', 'GHANA', 'GIBRALTAR', 'GREECE',
       'GRENADA', 'GUADELOUPE', 'GUATEMALA', 'GUINEA', 'GUINEA-BISSAU',
       'GUYANA', 'HAITI', 'HEARD AND MCDONALD IS.', 'HOLY SEE/VATICAN',
       'HONDURAS', 'HONG KONG', 'HUNGARY', 'ICELAND', 'INDIA',
       'INDIAN OCEAN AREAS (FRENCH)', 'INDIAN OCEAN TERRITORY',
       'INDONESIA', 'IRAN', 'IRAQ', 'IRELAND', 'ISRAEL', 'ITALY',
       'IVORY COAST', 'JAMAICA', 'JAPAN', 'JORDAN', 'KAMPUCHEA',
       'KAZAKHSTAN', 'KENYA', 'KIRIBATI', 'KOSOVO', 'KUWAIT',
       'KYRGYZSTAN', 'LAOS', 'LATVIA', 'LEBANON', 'LESOTHO', 'LIBERIA',
       'LIBYA', 'LIECHTENSTEIN', 'LITHUANIA', 'LUXEMBOURG', 'MACAU',
       'MACEDONIA', 'MADAGASCAR', 'MALAWI', 'MALAYSIA', 'MALDIVES',
       'MALI', 'MALTA', 'MARSHALL ISLANDS', 'MARTINIQUE', 'MAURITANIA',
       'MAURITIUS', 'MAYOTTE (AFRICA - FRENCH)',
       'MICRONESIA, FED. STATES OF', 'MOLDOVA', 'MONACO', 'MONGOLIA',
       'MONTENEGRO', 'MONTSERRAT', 'MOROCCO', 'MOZAMBIQUE', 'NAMIBIA',
       'NAURU', 'NEPAL', 'NETHERLANDS', 'NETHERLANDS ANTILLES',
       'NEW CALEDONIA', 'NEW ZEALAND', 'NICARAGUA', 'NIGER', 'NIGERIA',
       'NIUE', 'NORTH KOREA', 'NORWAY', 'OMAN', 'PAKISTAN', 'PALAU',
       'PALESTINE', 'PANAMA', 'PAPUA NEW GUINEA', 'PARAGUAY', 'PERU',
       'PHILIPPINES', 'PITCAIRN ISLANDS', 'POLAND', 'PORTUGAL', 'QATAR',
       'REPUBLIC OF SOUTH SUDAN', 'REUNION', 'ROMANIA', 'RUSSIA',
       'RWANDA', 'SAN MARINO', 'SAO TOME AND PRINCIPE', 'SAUDI ARABIA',
       'SENEGAL', 'SERBIA AND MONTENEGRO', 'SERBIA', 'SEYCHELLES',
       'SIERRA LEONE', 'SINGAPORE', 'SLOVAKIA', 'SLOVENIA',
       'SOLOMON ISLANDS', 'SOMALIA', 'SOUTH AFRICA', 'SOUTH KOREA',
       'SPAIN', 'SRI LANKA', 'ST. HELENA', 'ST. KITTS-NEVIS', 'ST. LUCIA',
       'ST. PIERRE AND MIQUELON', 'ST. VINCENT-GRENADINES',
       'SAINT BARTHELEMY', 'SAINT MARTIN', 'SAINT MAARTEN', 'SUDAN',
       'SURINAME', 'SWAZILAND', 'SWEDEN', 'SWITZERLAND', 'SYRIA',
       'TAIWAN', 'TAJIKISTAN', 'TANZANIA', 'THAILAND', 'TOGO', 'TONGA',
       'TRINIDAD AND TOBAGO', 'TUNISIA', 'TURKEY', 'TURKMENISTAN',
       'TURKS AND CAICOS ISLANDS', 'TUVALU', 'UGANDA', 'UKRAINE',
       'UNITED ARAB EMIRATES', 'UNITED KINGDOM', 'URUGUAY', 'UZBEKISTAN',
       'VANUATU', 'VENEZUELA', 'VIETNAM', 'WALLIS AND FUTUNA ISLANDS',
       'WEST INDIES (FRENCH)', 'WESTERN SAHARA', 'WESTERN SAMOA', 'YEMEN',
       'YUGOSLAVIA', 'ZAIRE', 'ZAMBIA', 'ZIMBABWE',
       'INVALID: AMERICAN SAMOA', 'INVALID: ANTARCTICA',
       'INVALID: BORN ON BOARD SHIP',
       'INVALID: BOUVET ISLAND (ANTARCTICA/NORWAY TERR.)',
       'INVALID: CANADA', 'INVALID: CANTON AND ENDERBURY ISLS',
       'INVALID: CZECHOSLOVAKIA',
       'INVALID: DRONNING MAUD LAND (ANTARCTICA-NORWAY)',
       'INVALID: FRENCH SOUTHERN AND ANTARCTIC', 'INVALID: GREENLAND',
       'INVALID: GUAM', 'INVALID: INTERNATIONAL WATERS',
       'INVALID: JOHNSON ISLAND', 'INVALID: MARIANA ISLANDS, NORTHERN',
       'INVALID: MIDWAY ISLANDS', 'INVALID: MINOR OUTLYING ISLANDS - USA',
       'INVALID: NEUTRAL ZONE (S. ARABIA/IRAQ)',
       'INVALID: NON-QUOTA IMMIGRANT', 'INVALID: PUERTO RICO',
       'INVALID: STATELESS', 'INVALID: UNITED STATES', 'INVALID: UNKNOWN',
       'INVALID: UNKNOWN COUNTRY', 'INVALID: USSR',
       'INVALID: U.S. VIRGIN ISLANDS', 'INVALID: WAKE ISLAND',
       'Collapsed Tanzania (should not show)',
       'Collapsed Curacao (should not show)', 'No Country Code (54)',
       'No Country Code (100)', 'No Country Code (187)',
       'No Country Code (190)', 'No Country Code (200)',
       'No Country Code (219)', 'No Country Code (238)',
       'No Country Code (277)', 'No Country Code (293)',
       'No Country Code (300)', 'No Country Code (319)',
       'No Country Code (365)', 'No Country Code (395)',
       'No Country Code (400)', 'No Country Code (485)',
       'No Country Code (503)', 'No Country Code (589)',
       'No Country Code (592)', 'No Country Code (791)',
       'No Country Code (849)', 'No Country Code (914)',
       'No Country Code (944)', 'No Country Code (996)'], dtype=object)

In [6]:
df_sas[df_sas['column'] == 'i94mode']

    id   description   column
949  1           Air  i94mode
950  2           Sea  i94mode
951  3          Land  i94mode
952  9  Not reported  i94mode

In [4]:
df_us = pd.read_csv('/home/felipe/Documentos/Udacity/Data Engineering Nanodegree/Udacity_final_project/data/us-cities-demographics.csv', delimiter=';')
df_us.head()

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,Silver Spring,Maryland,33.8,40601.0,41862.0,82463,1562.0,30908.0,2.60,MD,Hispanic or Latino,25924
1,Quincy,Massachusetts,41.0,44129.0,49500.0,93629,4147.0,32935.0,2.39,MA,White,58723
2,Hoover,Alabama,38.5,38040.0,46799.0,84839,4819.0,8229.0,2.58,AL,Asian,4759
3,Rancho Cucamonga,California,34.5,88127.0,87105.0,175232,5821.0,33878.0,3.18,CA,Black or African-American,24437
4,Newark,New Jersey,34.6,138040.0,143873.0,281913,5829.0,86253.0,2.73,NJ,White,76402

In [17]:
# df_cit[df_cit['country']]
df_cit.groupby('description')['description'].count().sort_values(ascending=False)

description
INVALID: UNITED STATES                              2
INVALID: STATELESS                                  2
AFGHANISTAN                                         1
No Country Code (395)                               1
No Country Code (319)                               1
                                                   ..
INVALID: BORN ON BOARD SHIP                         1
INVALID: BOUVET ISLAND (ANTARCTICA/NORWAY TERR.)    1
INVALID: CANADA                                     1
INVALID: CANTON AND ENDERBURY ISLS                  1
ZIMBABWE                                            1
Name: description, Length: 287, dtype: int64

In [6]:
df_sas[df_sas['id'] == "LOS"]

      id      description   column
333  LOS  LOS ANGELES, CA  i94port